var data = [];

var dataStr = "\
sm&辣鸡&超级可爱温暖的铲屎官一枚$\
ds&矮油&初见矮油$\
yzj&矮油&非常不情愿的矮油$\
hyq&矮油&被迫营业的矮油$\
dlf&小七&虽然是矮油和辣鸡的照片墙但是小七也不能少$\
zsq&睡美人&不知道梦见什么才能睡成这样$\
gg&矮油&睡美人矮油$\
cyx&矮油&睡美人再得一分$\
le&矮油&超凶的矮油$\
ggay&嘎嘎和矮油&黑白双煞$\
zpai&拉肚肚的矮油&早日康复（抓紧变胖！）--2021.11.7$\
aygg&嘎嘎和矮油&抱着矮油屁屁睡觉的嘎嘎--2021.11.9$\
kkkk&困困困困&惊人同步的困猫--2021.11.9$\
ayt&矮油&猫团--2021.11.10$\
wm0&小汪&路人视角--2021.12.31$\
gaga0&嘎嘎&叮当猫型态--2022.1.21$\
ay0&矮油&圣诞蝴蝶结限定--2022.1.16$\
ay1&矮油&落魄少爷--2022.1.22$\
xw&小汪&来自小汪的wink--2021.11.7\
"

var d = dataStr.split("$");
for(var i = 0; i<d.length; i++){
  var c = d[i].split("&");
  data.push({
    img: c[0]+ ".jpg",
    caption: c[1],
    desc: c[2]
  });
}

